{
  "architectures": [
    "PowerCoderForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 50256,
  "dtype": "float32",
  "embedding_dropout": 0.0,
  "eos_token_id": 50256,
  "hidden_act": "gelu_pytorch_tanh",
  "hidden_size": 3072,
  "hybrid_exp": "none",
  "initializer_range": 0.018042,
  "intermediate_size": 12288,
  "max_position_embeddings": 4096,
  "model_type": "powercoder",
  "norm_epsilon": 1e-05,
  "num_attention_heads": 24,
  "num_hidden_layers": 30,
  "num_key_value_heads": 2,
  "residual_dropout": 0.0,
  "rope_scaling": null,
  "rope_theta": 10000.0,
  "sliding_window": null,
  "transformers_version": "4.57.0.dev0",
  "use_bias": true,
  "use_cache": true,
  "vocab_size": 49152
}
